---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.ColumnsExcluded
source: html/d8418665-8d3d-4e4f-6223-70829b54fdba.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.ColumnsExcluded Property

Some columns in the project are excluded from the graphical column schedule view.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnsExcluded { get; }
```